<template>
  <section class="w-full mt-16 py-5">
    <NuxtLayout name="container" class="flex flex-col gap-10">
      <h1 class="text-secondary-gray text-3xl font-bold">
        پروژه‌های اخیر مجموعه
      </h1>
      <div class="flex items-center gap-10">
        <WorksWork v-for="work in works" :key="work.id" :work />
      </div>
    </NuxtLayout>
  </section>
</template>

<script setup>
  import work1 from "/images/work1.jpg";
  import work2 from "/images/work2.jpg";
  import work3 from "/images/work3.jpg";

  const works = [
    {
      id: 1,
      title: "آرتم - کمپین دیجیتال مارکتینگ",
      caption:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده",
      img: work1,
    },
    {
      id: 2,
      title: "Mayhem - بهینه سازی موتورهای جستجو",
      caption:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده",
      img: work2,
    },
    {
      id: 3,
      title: "پایه - پرداخت به ازای کلیک (PPC)",
      caption:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده",
      img: work3,
    },
  ];
</script>

<style lang="scss" scoped></style>
